## Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [5]:
import pandas as pd

In [15]:
data = (4,8,15,16,23,42)
A = pd.Series(data)

In [17]:
A

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

## Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [22]:
data1 = [1,2,4,5,6,8,9,20,30,90]

In [26]:
pd.Series(data1)

0     1
1     2
2     4
3     5
4     6
5     8
6     9
7    20
8    30
9    90
dtype: int64

In [34]:
pd.DataFrame({"Name" : ["Alice" , "Bob" , "Claire" ],
              "Age" : [25,30,27],
              "Gender" : ["Female", "Male" , "Female"] })

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

## What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [38]:
#Data frame is a two dimesional data structure which contain multiple list of heterogenous type of data
# Series is a one dimensional data structure which contains a single list and can contain any heterogenous type of data

In [56]:
# example of series 
data1 = [1,2,4,5,6,8,9,20,30,90]
A = pd.Series(data)
type(A)

pandas.core.series.Series

In [60]:
# Example of Data frame
D = pd.DataFrame({"Name" : ["Alice" , "Bob" , "Claire" ],
              "Age" : [25,30,27],
              "Gender" : ["Female", "Male" , "Female"] })

In [66]:
type(D)

pandas.core.frame.DataFrame

## What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
## you give an example of when you might use one of these functions?

In [72]:
D.head()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [78]:
D.drop_duplicates()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [86]:
D.dropna()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

## Which of the following is mutable in nature Series, DataFrame, Panel?

In [90]:
# Series - Immutable
# DataFrame - Mutable
# Panel - Mutable

## Create a DataFrame using multiple Series. Explain with an example.

In [114]:
s1 = [1,2,4]
s2 = ["Hoomeid" , "Alam" , "Datascience"]

In [116]:
pd.Series(s1)
pd.Series(s2)

0        Hoomeid
1           Alam
2    Datascience
dtype: object

In [118]:
frame = { "values" : s1,
         "Names" : s2
}

In [124]:
df = pd.DataFrame(frame)

In [126]:
df

   values        Names
0       1      Hoomeid
1       2         Alam
2       4  Datascience